#Использовать cmdline
#Использовать logos
#Использовать "."

Процедура ВыполнитьКоманду()
	
	Лог = Логирование.ПолучитьЛог("oscript.app.k2-sonar-scanner");
	
	значениеПараметра = ПолучитьПеременнуюСреды("DEBUG_CI");
	ВключенРежимотладки = НРег(значениеПараметра) = "true" ИЛИ НРег(значениеПараметра) = "истина";
	
	Если ВключенРежимотладки Тогда
		
		Лог.УстановитьУровень(УровниЛога.Отладка);
		
		Логирование.ПолучитьЛог("oscript.lib.commands").УстановитьУровень(УровниЛога.Отладка);
		
		Лог.Информация("Включен режим отладки");

	КонецЕсли;
	
	Парсер = Новый ПарсерАргументовКоманднойСтроки();
	Парсер.ДобавитьПараметрФлаг("-mr");
	
	параметры = Парсер.Разобрать(АргументыКоманднойСтроки);
	
	ЭтоПроверкаЗапросаНаСлияние = параметры["-mr"];
	
	ПараметрыПроверки = Новый ПараметрыПроверки(Лог);
	
	ПодготовитьФайлПоддержки(ПараметрыПроверки.Src);

	ПроверкаЕДТ = Новый ПроверкаЕДТ(ПараметрыПроверки, Лог);
	ПроверкаЕДТ.Исполнить();

	СонарСканер = Новый СонарСканер(ПараметрыПроверки, ЭтоПроверкаЗапросаНаСлияние, Лог);
	СонарСканер.Исполнить();
	
КонецПроцедуры

Процедура ПодготовитьФайлПоддержки(Знач ПутьКИсходномуКоду)
	
	переименованныйФайлПоддержки = ОбъединитьПути(ПутьКИсходномуКоду, "Configuration", "_ParentConfigurations.bin");
	путьКФайлуПоддержки = ОбъединитьПути(ПутьКИсходномуКоду, "Configuration", "ParentConfigurations.bin");

	файлПоддержки = Новый Файл(переименованныйФайлПоддержки);
	
	Если файлПоддержки.Существует() Тогда

		КопироватьФайл(переименованныйФайлПоддержки, путьКФайлуПоддержки);

	КонецЕсли;

КонецПроцедуры

ВыполнитьКоманду();